emacs/.emacs.d/synthmacs.org
#+TITLE: SYNTHMACS Config
#+AUTHOR: roux g. buciu
#+DESCRIPTION: adudenamedruby's emacs configuration
#+STARTUP: showeverything
#+OPTIONS: auto-id:t
#+OPTIONS: broken-links:t
#+OPTIONS: tags:nil
#+OPTIONS: toc:4
#+PROPERTY: header-args:emacs-lisp :comments link

* TABLE OF CONTENTS :toc:
:PROPERTIES:
:CUSTOM_ID: h:D9FC65D1-4FFB-4344-B8A7-9FAA9D1AC040
:END:

- [[#introduction][Introduction]]
  - [[#what-is-a-synthmacs][What is a ~Synthmacs~?]]
  - [[#about-synthmacsorg][About ~synthmacs.org~]]
  - [[#why-vanilla-emacs][Why vanilla Emacs?]]
  - [[#why-a-literate-config][Why a literate config?]]
  - [[#synthmacs-modules][Synthmacs "modules"]]
  - [[#structure-of-this-configuration][Structure of this configuration]]
- [[#startup-optimization][Startup Optimization]]
  - [[#early-initel][early-init.el]]
  - [[#initel][init.el]]
  - [[#initel-load-modules][init.el load modules]]
- [[#package-management][Package Management]]
  - [[#bootstrap-straight-and-straight-use-package][Bootstrap Straight and straight-use-package]]
- [[#core-emacs-setup][Core Emacs Setup]]
  - [[#emacs-setup][Emacs Setup]]
  - [[#custom-variables][Custom variables]]
  - [[#fonts][Fonts]]
  - [[#free-functions][Free Functions]]
  - [[#garbage-collector-magic-hack][Garbage collector magic hack]]
  - [[#no-littering][no-littering]]
  - [[#auto-pair-paranthesis][Auto-pair paranthesis]]
  - [[#xref][xref]]
- [[#keybindings-general--evil-mode][Keybindings: General & EVIL mode]]
  - [[#general][General]]
  - [[#general-keybindings][General keybindings]]
  - [[#hydra][Hydra]]
  - [[#evil-mode][EVIL mode]]
- [[#org-mode][Org Mode]]
  - [[#org-mode-1][org mode]]
  - [[#enabling-the-table-of-contents][Enabling the Table of Contents]]
  - [[#org-reverse-datetree][org reverse datetree]]
  - [[#org-superstar][org-superstar]]
  - [[#cycle-only-one-heading][Cycle only one heading]]
  - [[#using-org-id-in-links][Using org-id in links]]
  - [[#org-babel][org-babel]]
  - [[#tangling-this-file][Tangling this file]]
  - [[#org-tree-slide][org-tree-slide]]
  - [[#evil-org-mode][evil-org-mode]]
  - [[#org-appear][org-appear]]
  - [[#org-roam][org-roam]]
  - [[#obsidian][Obsidian]]
- [[#ui][UI]]
  - [[#icons][Icons]]
  - [[#themes][Themes]]
  - [[#navigation][Navigation]]
  - [[#modeline][Modeline]]
  - [[#dashboard][Dashboard]]
  - [[#which-key][which-key]]
  - [[#rainbow-delimiters][rainbow-delimiters]]
  - [[#popup-management][Popup management]]
  - [[#centered-cursor-mode][centered-cursor-mode]]
  - [[#highlight-indent-guides][highlight-indent-guides]]
  - [[#line-numbers][Line numbers]]
  - [[#fill-column--modeline-column-info][Fill column & modeline column info]]
- [[#completion-framework][Completion framework]]
  - [[#vertico][Vertico]]
  - [[#consult][Consult]]
  - [[#marginalia][Marginalia]]
  - [[#embark][Embark]]
  - [[#embark-consult][embark-consult]]
  - [[#wgrep][wgrep]]
  - [[#corfu][Corfu]]
- [[#useful-tools][Useful Tools]]
  - [[#dirvish][Dirvish]]
  - [[#gitvcs-integration][Git/VCS Integration]]
  - [[#helpful][Helpful]]
  - [[#projectile][Projectile]]
  - [[#rg][Rg]]
  - [[#undo-fu][undo-fu]]
  - [[#ws-butler][WS-Butler]]
  - [[#olivetti-mode][Olivetti Mode]]
  - [[#vterm][Vterm]]
  - [[#transient][Transient]]
- [[#programming-environment][Programming Environment]]
  - [[#lsp][LSP]]
  - [[#dap][DAP]]
  - [[#flycheck][Flycheck]]
  - [[#imenu][iMenu]]
  - [[#snippets][Snippets]]
  - [[#treesitter][Treesitter]]
- [[#programming-languages][Programming Languages]]
  - [[#haskell][Haskell]]
  - [[#html][HTML]]
  - [[#lisps][LISPs]]
  - [[#markdown][Markdown]]
  - [[#rust][Rust]]
  - [[#swift][Swift]]
  - [[#yaml][YAML]]
- [[#provide-modules][Provide modules]]
  - [[#early-initel-1][early-init.el]]
  - [[#initel-1][init.el]]
  - [[#synthmacs-core][synthmacs-core]]
  - [[#synthmacs-package-management][synthmacs-package-management]]
  - [[#synthmacs-general-evil][synthmacs-general-evil]]
  - [[#synthmacs-org][synthmacs-org]]
  - [[#synthmacs-ui][synthmacs-ui]]
  - [[#synthmacs-completion-framework][synthmacs-completion-framework]]
  - [[#synthmacs-tools][synthmacs-tools]]
  - [[#synthmacs-programming][synthmacs-programming]]
  - [[#programming-languages-1][Programming Languages]]

* Introduction
:PROPERTIES:
:CUSTOM_ID: h:49282F28-9E13-48D2-A565-1605B1CC57B8
:END:

** What is a ~Synthmacs~?
:PROPERTIES:
:CUSTOM_ID: h:945224F8-D3DC-44B3-BC29-FB815F13E971
:END:
~Synthmacs~ is what I've decided to call my Emacs config. It's a portmanteau of Sythesized and Emacs. But it's also inspired by "Synthwave" and "Synthesizers". Anyway, it's not a big deal, and you shouldn't worry about it!!

** About ~synthmacs.org~
:PROPERTIES:
:CUSTOM_ID: h:D9ED3ADB-810A-4A1C-A1D3-5397874AFAC7
:END:
This file (~synthmacs.org~) is the literate Synthmacs configuration. Every time I save the file, the code blocks get tangled, asynchronously. By default, they get tangled (in sequence) to ~./init.el~. However, some blocks override this default (e.g. see the section [[*early-init.el][early-init.el]]), meaning that I end up with what are, essentially, modules in which things are organized in some way that makes sense to me. More on that [[#h:C522D670-C206-44F7-96CE-17D01E578287][here]].

** Why vanilla Emacs?
:PROPERTIES:
:CUSTOM_ID: h:40A8BDAE-F8E3-4DB3-AC8C-7E5067B7EE4D
:END:
My introduction to Emacs was... Vim? I love Vim. Or rather, I love language for text manipulation that comprise Vim's composable motions and commands. But what I really wanted was to use those keybindings throughout many of the things I'm doing, and not just in Vim. So I switched over to Vimium in my browser. I started using Xvim in Xcode. Basically wherever I could have Vim keybindings, I did. But I also wanted to be able to customize certain behaviours of my editor to the extent that just wasn't possible with Vim, and I knew that Emacs was the thing that would let me do that. Minor problem: I didn't know anything about Emacs, and I didn't know anything about E-Lisp, and I didn't have the time to set everything up myself (knowing how big that entry learning curve is from having learned to use Vim). So, I tried a distribution of Emacs, and ended up using [[https://www.spacemacs.org/][Spacemacs]] for several years.

I was mostly happy.

Three things changed:
1. I started to learn LISP
2. That made me want to understand Emacs a little more
3. Spacemacs is really great... but the one thing that always bothered me was that the way it's put together makes it very different to how a normal config looks. So often, changing some things by looking at other's people's configs was.... challenging

Over the next few weeks, I started the process of experimenting with my own config. I took a lot of inspiration from a ton of people, shamelessly stealing ideas to make my config better... or just make Emacs have the behaviour I wanted. I've tried to credit code sources where possible. However, in my haste from earlier efforts, I don't have credits for everything. For anything that's not original, here's a non-exhaustive list of some of the main places I was inspired by:
- [[https://github.com/abougouffa/minemacs/blob/ab9084efe27191fd0ab5f94eee5502766fce16c1/modules/me-lisp.el#L43][abougouffa]]
- [[https://github.com/daedreth/UncleDavesEmacs/blob/master/config.org][daedreth]]
- [[https://writequit.org/org/#2daddf2c-228b-40ae-90b1-cd0b8c39f061][dakrone]]
- [[https://gitlab.com/dwt1/dotfiles/-/blob/2a687641af1fa4e31e080960e0b6a5f3d21d759d/.emacs.d.gnu/config.org][DistroTube Config]] & [[https://gitlab.com/dwt1/dotfiles/-/blob/1e82fff55a15bbff605789cbb412ea43efb924f0/.config/doom/config.org][Distro Tube Doom Config]]
- [[https://github.com/howardabrams/dot-files][HowardAbrams]]
- [[https://github.com/jimeh/.emacs.d/tree/master/core][jimeh]]
- [[https://github.com/jinnovation/.emacs.d][jinnovation]]
- [[https://www.lucacambiaghi.com/vanilla-emacs/readme.html#h:4C37CFFC-D045-47B4-BFDC-801977247199][Luca Cambiaghi]]
- [[https://github.com/meatcar/emacs.d/blob/377c5abc4d45927d5badbf5f32debc9162a465fa/config.org#L1320][meatcar]]
- [[https://protesilaos.com/emacs/dotemacs][Prot]]
- [[https://github.com/renzmann/.emacs.d/blob/main/README.org][renzmann]]
- [[https://github.com/r0man/.emacs.d/blob/b344a9bed55421e2288a1c135ccb9cf9b7591de4/init.el.org#L2019][r0man]]
- [[https://robbmann.io/emacsd/][robbmann]]
- [[https://config.daviwil.com/emacs][System Crafters]]
- [[https://github.com/vale981/dotfiles/blob/7d7971b91356b271dd08afbaf9979fba33d471ed/dots/emacs/emacs.org#L1020][vale981]]
  
It is a long journey, and I still have a long way to go, but I am glad I started it.

** Why a literate config?
:PROPERTIES:
:CUSTOM_ID: h:B5231F9E-07D2-4738-97FD-78EC648B3F3D
:END:
Having your configuration in ~org-mode~ has some benefits and some drawbacks. Further, it adds a layer of abstraction between me and my ~init.el~ file. So, is it worth it?

The main, and biggest, drawback is that it can happen that the ~org-mode~ file has a mistake and tangles an incorrect ~*.el~ file. In that case you can't use your nice bindings but you are thrown in barebones Emacs and you have to =C-x C-f= your way to the ~init.el~ and run ~M-x check-parens~.

You can also run ~org-babel-tangle-jump-to-org~ from the tangled file if you add:
#+begin_src org
,#+PROPERTY: header-args:emacs-lisp :comments link
#+end_src

Another drawback is that a big configuration can be slow to tangle and tangling on save can block ~emacs~. The solution for this is to do the tangling asynchronously. See [[#h:16B948EA-5375-44DE-ACD7-3664D4A9CE5F][this section]] for how that's accomplished.

Let's consider some of the benefits:
- People can read this file on Github pretty easily. It's how I learned a lot about Emacs, and I think the trade is worthwhile to give back.
- I can comfortably document my configuration (and not from within comments), include links, ~sh~ code blocks, etc.
- I can organize my configuration blocks in sections, easily disable some headings with ~COMMENT~ if I so need, as well as prevent some block from tangling if I have ~:tangle no~ added to the source block

** Synthmacs "modules"
:PROPERTIES:
:CUSTOM_ID: h:C522D670-C206-44F7-96CE-17D01E578287
:END:
I tangle this file with the function ~synthmacs/tangle-config~, you can read source code in [[#h:16B948EA-5375-44DE-ACD7-3664D4A9CE5F][this]] section. Every time I save the ~synthmacs.org~ file, it is tangled to multiple ~.el~ files.

I achieve that by means of this file's "local variables", which I put at the end of the ~synthmacs.org~ file:
#+begin_src org
# Local Variables:
# eval: (add-hook 'after-save-hook (lambda ()(progn (synthmacs/org-add-ids-to-headlines-in-file) (synthmacs/tangle-config))) nil t)
# End:
#+end_src

To design modules, I look at blocks in my config that I might want to toggle on and off. I assign org properties to each heading. These are what determine which ~.el~ file they will be written to.

For example the header of the section concerning ~lsp-mode~ might have the following properties:
#+begin_src org
:PROPERTIES:
:CUSTOM_ID: h:6BC08822-D2B3-4BE9-9EBE-C42F89F0E688
:header-args: :emacs-lisp :tangle ./synthmacs/synthmacs-lsp.el
:END:
#+end_src

All subheadings under it will "inherit" those properties and will be tangled to the same file. We also need to write some ~emacs-lisp~ at the end of the tanged file to "provide" those modules. [[#h:24A7FE78-E6B9-4C81-A2BE-6A049A8209AD][Here]] an example of one of these "footer" headers.

I then have a lean ~init.el~ (written in [[#h:7B22A4F3-49A1-4848-A185-B4EEA060EECE][this]] section) which I use to control which modules I want to use. Why turn off modules? Maybe something's acting up? Maybe I'm setting something up brand new and, while I'm still figuring things out, I want it enabled when I'm working on my config, but I don't want it enabled when I'm actually using Emacs for doing actual work.

** Structure of this configuration
:PROPERTIES:
:CUSTOM_ID: h:0FFBBB41-3AD1-4C09-A15D-FA9A03B6C2CB
:END:
In general, the config tries to manintain a pretty cohesive modularization while observing a few guidelines. In no particular order, these are:
- Things should be loosely organized according to function where possible
- Keybindings should try to stay, as closely as possible, to the various modules they belong to. Thus, if I disable a module, its keys aren't still listed in which-key
- As much as possible, functions should not be free-floating, but should be part of the init or general module of whatever thing they're most related to 

With that out of the way, the general outline of this file aims to be:
- The [[#h:49282F28-9E13-48D2-A565-1605B1CC57B8][first section]] is some information about ~synthmacs.org~ and other comments for my future self or anyone else who happens to be reading this. Hello!
- In the [[#h:EC68944C-F745-45D8-9905-420E0813DBAF][second section]], we have some optimization to startup time. Most of these things are from other people, because I am not as wise in the Emacs ways.
- In the [[#h:F8B6E0EE-7BBD-4F7F-B31E-44DE7B43AA39][third section]], we setup our package managers, ~straight~ and  ~use-package~
- In the [[#h:3D38D8F0-1B85-4265-9941-77A3A2FA235B][fourth section]], we configure ~emacs~ with some better defaults and extend some some of its core features (e.g. ~help-mode~)
- In the [[#h:D7FB11B6-67B4-4275-B0CC-E218C65C411E][fifth section]], we set up ~general~, which we use to manage our keybindings and lazy loading of packages. Afterwards we configure ~evil~, for modal editing.
- In the [[#h:B1DBE90D-B6C9-4BD4-B15B-185FE238D236][sixth section]], we define some standards for the invaluable ~org-mode~ with several extensions
- In the [[#h:EA84335B-2A51-4B4A-9392-F116289EDB10][seventh section]], we configure UI related things: themes, icons, window management, navigation, etc
- In the [[#h:FB3661CB-A573-40B6-B331-449D77DBD199][eighth section]], we configure useful our completion frameworks.
- In the [[#h:B57C03F6-2111-489A-9303-B1A06C95EFF5][ninth section]], we configure useful Emacs tools that aren't big enough to fit in their own header, but don't necessarily fit elsewhere either: git integration with ~magit~, terminal setup, projectile, etc.
- In the [[#h:2E967F87-8304-4262-B5BF-3286ACA7211B][tenth section]], we set up the tools for programming
- In the [[#h:732BA080-834D-49E0-967E-0D37CE1C6BA0][eleventh section]], we then configure different languages I use for programming to use those tools
- The [[#h:754DFB20-B2AB-4750-9BDA-D24E8014C504][twelfth, and final, section]] will be providing the ~provide~ statement for each module without which things would fall apart.

* Startup Optimization
:PROPERTIES:
:CUSTOM_ID: h:EC68944C-F745-45D8-9905-420E0813DBAF
:END:

** early-init.el
:PROPERTIES:
:CUSTOM_ID: h:7DBC58C1-3944-437C-87F9-95C9202BD34E
:header-args: :emacs-lisp :tangle early-init.el
:END:

*** Header
:PROPERTIES:
:CUSTOM_ID: h:CDE376DB-BA7E-459F-B1BD-F423C530C414
:END:
#+begin_src emacs-lisp
;;; early-init.el --- Early Init File -*- lexical-binding: t; no-byte-compile: t -*-
;; NOTE: early-init.el is now generated from synthmacs.org.  Please edit that file instead
#+end_src

