emacs/.emacs.d/synthmacs.org
*** Disable package/UI at first
:PROPERTIES:
:CUSTOM_ID: h:54977927-B3A4-4502-992F-F7BA85FD5AB1
:END:

#+BEGIN_SRC emacs-lisp
;; In Emacs 27+, package initialization occurs before `user-init-file' is
;; loaded, but after `early-init-file'. Doom handles package initialization, so
;; we must prevent Emacs from doing it early!
(setq package-enable-at-startup nil)

;; Do not allow loading from the package cache (same reason).
(setq package-quickstart nil)

;; Prevent the glimpse of un-styled Emacs by disabling these UI elements early.
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)

;; Resizing the Emacs frame can be a terribly expensive part of changing the
;; font. By inhibiting this, we easily halve startup times with fonts that are
;; larger than the system default.
(setq frame-inhibit-implied-resize t)

;; Disable GUI elements
(setq menu-bar-mode -1)
(setq tool-bar-mode -1)
(when (fboundp 'set-scroll-bar-mode)
  (set-scroll-bar-mode nil))
(setq inhibit-splash-screen t)
(setq use-file-dialog nil)


;; Native-Comp
(setq native-comp-speed 2
      comp-speed 2)
(setq native-comp-async-report-warnings-errors nil
      comp-async-report-warnings-errors nil)
(setq native-comp-async-query-on-exit t
      comp-async-query-on-exit t)
#+END_SRC

*** Reduce garbage collection
:PROPERTIES:
:CUSTOM_ID: h:7A7EE86D-D60B-49F0-8738-05D88690060D
:END:
Following DOOM, we max the garbage collection threshold on startup, and reset it to the original value after.

#+BEGIN_SRC emacs-lisp
;; max memory available for gc on startup
(defvar me/gc-cons-threshold 16777216)
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.6)
(add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-threshold me/gc-cons-threshold
                  gc-cons-percentage 0.1)))

;; max memory available for gc when opening minibuffer
(defun synthmacs/defer-garbage-collection-h ()
  (setq gc-cons-threshold most-positive-fixnum))

(defun synthmacs/restore-garbage-collection-h ()
  ;; Defer it so that commands launched immediately after will enjoy the
  ;; benefits.
  (run-at-time
   1 nil (lambda () (setq gc-cons-threshold synthmacs/gc-cons-threshold))))

(add-hook 'minibuffer-setup-hook #'synthmacs/defer-garbage-collection-h)
(add-hook 'minibuffer-exit-hook #'synthmacs/restore-garbage-collection-h)
(setq garbage-collection-messages t)
#+END_SRC

*** Temporarily avoid special handling of files
:PROPERTIES:
:CUSTOM_ID: h:7DCD97B2-96A6-436B-AC41-F507CB842530
:END:
`file-name-handler-alist' is consulted on every `require', `load' and various path/io functions. You get a minor speed up by nooping this. However, this may cause problems on builds of Emacs where its site lisp files aren't byte-compiled and we're forced to load the *.el.gz files (e.g. on Alpine)

#+BEGIN_SRC emacs-lisp
(unless (daemonp)
  (defvar doom--initial-file-name-handler-alist file-name-handler-alist)
  (setq file-name-handler-alist nil)
  ;; Restore `file-name-handler-alist' later, because it is needed for handling
  ;; encrypted or compressed files, among other things.
  (defun doom-reset-file-handler-alist-h ()
    ;; Re-add rather than `setq', because changes to `file-name-handler-alist'
    ;; since startup ought to be preserved.
    (dolist (handler file-name-handler-alist)
      (add-to-list 'doom--initial-file-name-handler-alist handler))
    (setq file-name-handler-alist doom--initial-file-name-handler-alist))
  (add-hook 'emacs-startup-hook #'doom-reset-file-handler-alist-h)
  )

#+END_SRC

** init.el
:PROPERTIES:
:CUSTOM_ID: h:E6162DC2-7E1C-4843-8448-FF104A444B40
:header-args: :emacs-lisp :tangle init.el
:END:

*** Header
:PROPERTIES:
:CUSTOM_ID: h:470961E9-E775-4F50-861D-CC1A2616B4A1
:END:
#+BEGIN_SRC emacs-lisp
  ;;; init.el --- Personal configuration file -*- lexical-binding: t; no-byte-compile: t; -*-
;; NOTE: init.el is now generated from synthmacs.org.  Please edit that file instead
#+END_SRC

*** Improve I/O
:PROPERTIES:
:CUSTOM_ID: h:3AAFD5BF-28E5-4AA0-9911-E4430F4B4506
:END:
Optimizations for improving I/O performance. Increase max bytes read from a sub-process in a single op (Emacs 27+)

#+BEGIN_SRC emacs-lisp
(setq read-process-output-max (* 1024 1024)) ;; 1mb

;; Ensure Synthmacs is running out of this file's directory
(setq user-emacs-directory (file-truename (file-name-directory load-file-name)))

#+END_SRC

** init.el load modules
:PROPERTIES:
:CUSTOM_ID: h:7B22A4F3-49A1-4848-A185-B4EEA060EECE
:header-args: :emacs-lisp :tangle init.el
:END:
#+begin_src emacs-lisp
(message "SynthMacs is powering up, please be patient...")

;; (add-to-list 'load-path "~/.emacs.d/synthmacs/")
(add-to-list 'load-path (expand-file-name "synthmacs" user-emacs-directory))

(let ((file-name-handler-alist nil)
      (gc-cons-threshold 100000000))

  (require 'synthmacs-core)
  (require 'synthmacs-package-management)
  (require 'synthmacs-general-evil)
  (require 'synthmacs-ui)
  (require 'synthmacs-org)
  (require 'synthmacs-completion-framework)
  (require 'synthmacs-tools)
  (require 'synthmacs-programming)
  (require 'synthmacs-lang-clojure)
  (require 'synthmacs-lang-haskell)
  (require 'synthmacs-lang-html)
  (require 'synthmacs-lang-lisp)
  (require 'synthmacs-lang-clisp)
  (require 'synthmacs-lang-elisp)
  (require 'synthmacs-lang-markdown)
  (require 'synthmacs-lang-rust)
  (require 'synthmacs-lang-swift)
  (require 'synthmacs-lang-yaml)
  )
#+end_src

* Package Management
:PROPERTIES:
:CUSTOM_ID: h:F8B6E0EE-7BBD-4F7F-B31E-44DE7B43AA39
:END:

** Bootstrap Straight and straight-use-package
:PROPERTIES:
:CUSTOM_ID: h:686F7A63-013E-48ED-AC56-DF39BD398E20
:header-args: :emacs-lisp :tangle ./synthmacs/synthmacs-package-management.el :mkdirp yes
:END:

[[https://github.com/raxod502/straight.el][straight.el]] is used to download packages for us from all over the web. It stores them all in their respective git folders in ~.emacs.d/straight~, which makes debugging, and contributing fixes back upstream as easy as possible.

First, we configure some settings for ~staight.el~ to better integrate with ~use-package~. [[https://github.com/jwiegley/use-package][use-package]] is a nice and consistent way to declare packages and their respective configs.

Some rules/conventions:

- Prefer ~:init~ to ~:custom~. Prefer multiple ~setq~ expressions to one.
- Default to ~:defer t~, use ~:demand~ to force loading
- When packages do not require installation e.g. ~dired~, we need ~:straight (:type built-in)~ 
- If you specify ~:commands~, they will be autoloaded and the package will be loaded when the commands are first executed
  + If you use ~:general~ and bind commands to keys it will automatically load the package on first invokation

*** Initial setup
:PROPERTIES:
:CUSTOM_ID: h:DC526D93-55D3-4D6E-88A1-2696A7753D3E
:END:
First, setting some defaults for Straight
#+BEGIN_SRC emacs-lisp
(setq straight-repository-branch "develop")
(setq straight-use-package-by-default t)
;; (setq straight-recipes-gnu-elpa-use-mirror t)
;; (setq straight-check-for-modifications '(check-on-save find-when-checking))
;;(setq straight-check-for-modifications nil)
(setq use-package-always-ensure t)
(setq use-package-always-defer t)
#+END_SRC

*** Debug
:PROPERTIES:
:CUSTOM_ID: h:3F452C31-8C7C-4F5C-AE0C-66923780EE16
:END:
We want to enable debugging whenever we encounter an error.
#+begin_src emacs-lisp
(setq debug-on-error t)
#+end_src

*** Fetching ~straight.el~
:PROPERTIES:
:CUSTOM_ID: h:5F148603-9BBF-4A65-A09A-6A616B8DAAFC
:END:
#+BEGIN_SRC emacs-lisp
(setq straight-repository-branch "develop")
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 6))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
	(url-retrieve-synchronously
	 "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
	 'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
#+END_SRC

*** Package cleanup
:PROPERTIES:
:CUSTOM_ID: h:B5393607-D2E9-448C-9A72-3027EE6D1101
:END:
Let’s load an optional package which gives us some convenience functions, like ~straight-x-clean-unused-repo~ to remove any packages we don’t have configured anymore.

#+begin_src emacs-lisp
(require 'straight-x)
#+end_src

*** Install ~use-package~
:PROPERTIES:
:CUSTOM_ID: h:B461CF7F-5DD9-48E7-8DC7-EECDCBEF418D
:END:
#+BEGIN_SRC emacs-lisp
;; Install use-package
(straight-use-package 'use-package)
#+END_SRC

* Core Emacs Setup
:PROPERTIES:
:CUSTOM_ID: h:3D38D8F0-1B85-4265-9941-77A3A2FA235B
:header-args: :emacs-lisp :tangle ./synthmacs/synthmacs-core.el :mkdirp yes
:END:

** Emacs Setup
:PROPERTIES:
:CUSTOM_ID: h:51921EE3-AFC6-44A1-A700-316815CBFF49
:END:
Some general things to set up:

#+begin_src emacs-lisp
(use-package emacs
  :init
  (setq inhibit-startup-message t
	inhibit-startup-screen t
        initial-scratch-message nil
        sentence-end-double-space nil
        ring-bell-function 'ignore
        frame-resize-pixelwise t)

  ;; less noise when compiling elisp
  (setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))
  (setq native-comp-async-report-warnings-errors nil)
  (setq load-prefer-newer t)

  ;; write over selected text on input... like all modern editors do
  ;;(delete-selection-mode t)
  )
#+end_src

*** User setup
:PROPERTIES:
:CUSTOM_ID: h:C6B442E5-589B-43CA-B3F5-FE0A53CDBA66
:END:
Who is using Synthmacs?
#+begin_src emacs-lisp
(use-package emacs
  :init
  (setq user-full-name "roux g. buciu"
        user-mail-address "roux@fringe.foundation"))
#+end_src

*** "Yes or no" prompts
:PROPERTIES:
:CUSTOM_ID: h:1FFE6051-E84B-438A-9FA9-BB6A6EFBE77F
:END:
They are annoying and it's much more idiomatic to type y or n for these types of things anyway. So let's make sure Synthmacs confornms to this.

#+begin_src emacs-lisp
(use-package emacs
  :init
  (defalias 'yes-or-no-p 'y-or-n-p))
#+end_src

*** UTF-8 file encoding
:PROPERTIES:
:CUSTOM_ID: h:6E819D29-764F-4F26-B5CB-20766CE6579D
:END:
Sometimes file encoding is really messed up, so we make sure to default to UTF-8 for everything!

#+begin_src emacs-lisp
(use-package emacs
  :init
  (set-charset-priority 'unicode)
  (setq locale-coding-system 'utf-8
        coding-system-for-read 'utf-8
        coding-system-for-write 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8)
  (prefer-coding-system 'utf-8)
  (setq default-process-coding-system '(utf-8-unix . utf-8-unix)))
#+end_src

