emacs/.emacs.d/synthmacs.org
* Programming Languages
:PROPERTIES:
:CUSTOM_ID: h:732BA080-834D-49E0-967E-0D37CE1C6BA0
:END:

** Haskell
:PROPERTIES:
:CUSTOM_ID: h:28BA5E9F-6893-4E40-9F42-246F8731948C
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-haskell.el
:END:

** HTML
:PROPERTIES:
:CUSTOM_ID: h:5561B91C-C61D-47D5-8320-9A559032C762
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-html.el
:END:

** LISPs
:PROPERTIES:
:CUSTOM_ID: h:2171FA3F-D9BC-4058-9442-6827BABFC2CE
:END:

*** Clojure
:PROPERTIES:
:CUSTOM_ID: h:FF09BB1E-5437-4AFF-A4F5-367B92AF76CC
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-clojure.el
:END:

**** clojure-mode
:PROPERTIES:
:CUSTOM_ID: h:C6E789DD-6E2F-4CC4-A80B-236D86204624
:END:

#+begin_src emacs-lisp
(use-package clojure-mode
  :mode "\\.clj$"
  :init
  (setq clojure-align-forms-automatically t))
#+end_src

**** clojure-lsp
:PROPERTIES:
:CUSTOM_ID: h:A8775FBA-62ED-45B6-B069-55F008EC4A0F
:END:
#+begin_src emacs-lisp
(use-package clojure-mode
  :hook
  ((clojure-mode clojurescript-mode)
   . (lambda ()
       (setq-local lsp-enable-indentation nil ; cider indentation
                   lsp-enable-completion-at-point nil ; cider completion
                   )
       (lsp-deferred)))
  )
#+end_src

**** Cider
:PROPERTIES:
:CUSTOM_ID: h:E86F6D87-1832-4635-91A9-7556C9CF0939
:END:

#+begin_src emacs-lisp
(use-package cider
  :hook ((cider-repl-mode . evil-normalize-keymaps)
         (cider-mode . (lambda ()
                           (setq-local evil-lookup-func #'cider-doc)))
         (cider-mode . eldoc-mode))
  :general
  (synthmacs/local-leader-keys
    :keymaps 'clojure-mode-map
    "c" '(cider-connect-clj :wk "connect")
    "C" '(cider-connect-cljs :wk "connect (cljs)")
    "j" '(cider-jack-in :wk "jack in")
    "J" '(cider-jack-in-cljs :wk "jack in (cljs)")
    "d d" 'cider-debug-defun-at-point 
    "e b" 'cider-eval-buffer
    "e l" 'cider-eval-last-sexp
    "e L" 'cider-pprint-eval-last-sexp-to-comment
    "e d" '(cider-eval-defun-at-point :wk "defun")
    "e D" 'cider-pprint-eval-defun-to-comment
    "h" 'cider-clojuredocs-web 
    "K" 'cider-doc
    "q" '(cider-quit :qk "quit")
    )
  (synthmacs/local-leader-keys
    :keymaps 'clojure-mode-map
    :states 'visual
    "e" 'cider-eval-region)
  :init
  (setq nrepl-hide-special-buffers t)
  (setq nrepl-sync-request-timeout nil)
  (setq cider-repl-display-help-banner nil)
  )
#+end_src

**** ob-clojure
:PROPERTIES:
:CUSTOM_ID: h:E3F9FFBA-EE07-4399-A761-A28115AB2031
:END:

#+begin_src emacs-lisp
(use-package org
  :config
  (require 'ob-clojure)
  (setq org-babel-clojure-backend 'cider))
#+end_src

*** Common Lisp
:PROPERTIES:
:CUSTOM_ID: h:32C00231-247B-4BB8-9DF7-A733338041A0
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-clisp.el
:END:
  
#+begin_src emacs-lisp
(use-package sly)

(use-package sly-macrostep)

(use-package sly-repl-ansi-color
  :init
  (add-to-list 'sly-contribs 'sly-repl-ansi-color))
#+end_src

*** Emacs-lisp
:PROPERTIES:
:CUSTOM_ID: h:D036C70A-011B-49DD-82B7-8B077BB1123C
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-elisp.el
:END:

#+begin_src emacs-lisp
(use-package emacs
  :straight (:type built-in)
  :general
  (general-nmap
    :keymaps 'emacs-lisp-mode-map
    :states 'normal
   "gr" nil) ;; interferes with eval-operator
  )
#+end_src

*** General Lisp Tools
:PROPERTIES:
:CUSTOM_ID: h:DD59307A-C59B-4CF6-87CF-0C5D425E3F91
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-lisp.el
:END:

**** aggressive-indent
:PROPERTIES:
:CUSTOM_ID: h:BB3EB984-53C4-480A-9FD5-1EFBD6BA4D3F
:END:
Keeps the file indented nicely, but, this might clash with lsp stuff, so we only use it for Lisp stuff.
#+begin_src emacs-lisp
(use-package aggressive-indent
    :hook ((clojure-mode . aggressive-indent-mode)
           (lisp-mode . aggressive-indent-mode)
           (emacs-lisp-mode . aggressive-indent-mode)))
#+end_src

**** evil-lisp-state
:PROPERTIES:
:CUSTOM_ID: h:29AD92F1-04AB-4CE5-91F4-A1E4B187F0CE
:END:
- Wrap with ~SPC l w~
- Raise with ~SPC l r~
- Enter lisp-state with ~SPC l .~
- Navigate symbols with ~j~ and ~k~
- Navigate forms with ~h~ and ~l~
- Go to parent sexp with ~U~
- 
#+begin_src emacs-lisp
(use-package evil-lisp-state
  :after evil
  :demand
  :init
  (setq evil-lisp-state-enter-lisp-state-on-command nil)
  (setq evil-lisp-state-global t)
  ;; (setq evil-lisp-state-major-modes '(org-mode emacs-lisp-mode clojure-mode clojurescript-mode lisp-interaction-mode))
  :config
  (evil-lisp-state-leader "SPC l")
  )
#+end_src

** Markdown
:PROPERTIES:
:CUSTOM_ID: h:80E9702A-E2B6-44B5-A139-AD16C9B5D92F
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-markdown.el
:END:

#+begin_src emacs-lisp
(use-package markdown-mode
  :commands (markdown-mode gfm-mode)
  :mode
  (("README\\.md\\'" . gfm-mode)
   ("\\.md\\'" . markdown-mode)
   ("\\.markdown\\'" . markdown-mode))
  :init
  (setq markdown-command "multimarkdown"))
#+end_src

** Rust
:PROPERTIES:
:CUSTOM_ID: h:6355CFE4-6BA5-4134-BA38-74634F9FF919
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-rust.el
:END:

#+begin_src emacs-lisp
#+end_src

** Swift
:PROPERTIES:
:CUSTOM_ID: h:4C66614A-ED5B-4771-96C3-E2C789282DC1
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-swift.el
:END:
#+begin_src emacs-lisp
(use-package lsp-sourcekit
  :after lsp-mode
  :config
  (setq lsp-sourcekit-executable (string-trim (shell-command-to-string "xcrun --find sourcekit-lsp"))))

(use-package swift-mode
  :hook (swift-mode . (lambda () (lsp))))
#+end_src

** YAML
:PROPERTIES:
:CUSTOM_ID: h:0AB88184-7AE8-4232-B4A7-B8C4714B91D3
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-yaml.el
:END:

#+begin_src emacs-lisp
(use-package yaml-mode
  :mode ((rx ".yml" eos) . yaml-mode))
#+end_src

* Provide modules
:PROPERTIES:
:CUSTOM_ID: h:79F3414D-6DBD-420A-A955-913ACCB5A17B
:END:

** early-init.el
:PROPERTIES:
:CUSTOM_ID: h:C134637C-76BC-4013-91BE-3D273C12C691
:header-args: :emacs-lisp :tangle early-init.el
:END:
#+BEGIN_SRC emacs-lisp
  ;;; early-init.el ends here
#+END_SRC

** init.el
:PROPERTIES:
:CUSTOM_ID: h:0EDF1757-169B-4750-8262-415B599A4B53
:header-args: :emacs-lisp :tangle init.el
:END:
#+begin_src emacs-lisp
;;; init.el ends here
#+end_src

** synthmacs-core
:PROPERTIES:
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-core.el
:CUSTOM_ID: h:6C65C946-EAFF-4F1D-9501-0DC155A3719A
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-core)
;;; synthmacs-core.el ends here
#+end_src

** synthmacs-package-management
:PROPERTIES:
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-package-management.el
:CUSTOM_ID: h:BECD851C-F8A3-42DF-947E-9BDA87337575
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-package-management)
;;; synthmacs-package-management.el ends here
#+end_src

** synthmacs-general-evil
:PROPERTIES:
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-general-evil.el
:CUSTOM_ID: h:3CCD39F9-C228-4767-BBA8-0AA80322C01E
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-general-evil)
;;; synthmacs-general-evil.el ends here
#+end_src

** synthmacs-org
:PROPERTIES:
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-org.el
:CUSTOM_ID: h:3C05F9B9-F006-44AC-8DEE-F9EA2E6E3DB2
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-org)
;;; synthmacs-org.el ends here
#+end_src

** synthmacs-ui
:PROPERTIES:
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-ui.el
:CUSTOM_ID: h:46D11F9E-6108-4A88-888B-4DDBA1AD316A
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-ui)
;;; synthmacs-ui.el ends here
#+end_src

** synthmacs-completion-framework
:PROPERTIES:
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-completion-framework.el
:CUSTOM_ID: h:D7BA43FA-DCD5-49A8-A972-13FCE0465438
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-completion-framework)
;;; synthmacs-completion-framework.el ends here
#+end_src

** synthmacs-tools
:PROPERTIES:
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-tools.el
:CUSTOM_ID: h:3DE0D1E2-51E9-4DCC-96BD-227464214C7C
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-tools)
;;; synthmacs-tools.el ends here
#+end_src

** synthmacs-programming
:PROPERTIES:
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-programming.el
:CUSTOM_ID: h:CE800ACA-533D-4E20-8E62-75AB021FE36A
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-programming)
;;; synthmacs-programming.el ends here
#+end_src

** Programming Languages
:PROPERTIES:
:CUSTOM_ID: h:320148C4-896F-4FFF-90CD-08E91DCCED9E
:END:

*** synthmacs-lang-haskell
:PROPERTIES:
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-haskell.el
:CUSTOM_ID: h:6E27FD00-65D6-421C-9C96-B4A8877CA5BB
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-haskell)
;;; synthmacs-lang-haskell.el ends here
#+end_src

*** synthmacs-lang-html
:PROPERTIES:
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-html.el
:CUSTOM_ID: h:F0DD1F2F-A930-4C32-81AE-1D4730BF5FEF
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-html)
;;; synthmacs-lang-html.el ends here
#+end_src

*** LISPs
:PROPERTIES:
:CUSTOM_ID: h:FD16520D-EDBD-44ED-BFAE-8F8E6B9ED790
:END:

*** synthmacs-lang-clojure
:PROPERTIES:
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-clojure.el
:CUSTOM_ID: h:F6A9AC39-89F2-41DA-84DD-5AF7A01F351B
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-clojure)
;;; synthmacs-lang-clojure.el ends here
#+end_src

*** synthmacs-lang-clisp
:PROPERTIES:
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-clisp.el
:CUSTOM_ID: h:771E15AF-C8A5-49CD-B224-AE4103FD2822
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-clisp)
;;; synthmacs-lang-clisp.el ends here
#+end_src

*** synthmacs-lang-elisp
:PROPERTIES:
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-elisp.el
:CUSTOM_ID: h:29743F9F-3D7F-44A6-9CD6-369EB609D4E0
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-elisp)
;;; synthmacs-lang-elisp.el ends here
#+end_src

*** synthmacs-lang-lisp
:PROPERTIES:
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-lisp.el
:CUSTOM_ID: h:08483E03-F91B-4E81-8DAF-8C710A9AD0F8
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-lisp)
;;; synthmacs-lang-lisp.el ends here
#+end_src

*** synthmacs-lang-markdown
:PROPERTIES:
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-markdown.el
:CUSTOM_ID: h:4DC1FE56-048B-42E5-BBC0-C7D8C97A394A
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-markdown)
;;; synthmacs-lang-markdown.el ends here
#+end_src

*** synthmacs-lang-rust
:PROPERTIES:
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-rust.el
:CUSTOM_ID: h:B3C70973-504D-407A-A865-579F5A3DC1C1
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-rust)
;;; synthmacs-lang-rust.el ends here
#+end_src

*** synthmacs-lang-swift
:PROPERTIES:
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-swift.el
:CUSTOM_ID: h:778CF1D8-D2CA-4920-90BA-768D5C6EDC0E
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-swift)
;;; synthmacs-lang-swift.el ends here
#+end_src

*** synthmacs-lang-yaml
:PROPERTIES:
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-yaml.el
:CUSTOM_ID: h:B2672AC2-5D01-4636-9064-E9D313BB65D8
:END:
#+begin_src emacs-lisp
(provide 'synthmacs-lang-yaml)
;;; synthmacs-lang-yaml.el ends here
#+end_src

* COMMENT Local variables
:PROPERTIES:
:CUSTOM_ID: h:ADD147A9-382A-4D85-8A9A-7533E71BA96A
:END:
# Local Variables:
# eval: (add-hook 'after-save-hook (lambda ()(progn (synthmacs/org-add-ids-to-headlines-in-file) (synthmacs/tangle-config))) nil t)
# End:
