emacs/.emacs.d/synthmacs/synthmacs-package-management.el
;;; synthmacs-package-management.el ends here
;; synthmacs-package-management:1 ends here
